test/artillery/simple_load_test.yml
config:
  target: "http://localhost:4567"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 10
      rampTo: 20
      name: "Ramp up load"
    - duration: 60
      arrivalRate: 20
      name: "Sustained load"
  defaults:
    headers:
      User-Agent: "Artillery NodeBB Tester"

scenarios:
  - name: "Browse forum pages"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
      - think: 3
      - get:
          url: "/categories"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/popular"
          expect:
            - statusCode: 200